In [1]:
import pandas as pd

In [2]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
          {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

# Count the total NaN values

We can clearly see that the DataFrame we created has 3 NaN values: one in store 1 and two in store 3.

However, in cases where we load very large datasets into a DataFrame, possibly with millions of items, the number of NaN values is not easily visualized.

For these cases, we can use a combination of methods to count the number of NaN values in our data.

### isnull()
isnull is a method the returns a Boolean DataFrame with True in places where NaN is present and False otherwise.

In [3]:
store_items.isnull()

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In Pandas, logical True values have numerical value 1 and logical False values have numerical value 0.

Therefore, we can count the number of NaN values by counting the number of logical True values.

This will return a Pandas Series with the sum of NaN counts over each column in the DataFrame.

In [4]:
store_items.isnull().sum() #default axis=0 (freez rows, sum on columns)

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

# count()
Instead of counting the number of NaN values we can also do the opposite, we can count the number of non-NaN values.

We can do this by using the .count() method.

In [5]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

# isnull.sum + count

In [6]:
x = store_items.count() + store_items.isnull().sum() # total celles in each column
x

bikes      3
pants      3
watches    3
shirts     3
shoes      3
suits      3
glasses    3
dtype: int64

In [7]:
x.sum() == store_items.size

True

# Eliminating NaN Values

Now that we learned how to know if our dataset has any NaN values in it, the next step is to decide what to do with them.

In general, we have two options:
1. Delete them (rows or columns)
2. Replace them with some values.

### 1- Delete NaN Values

**DataFrame.dropna(axis):** specify how to delete NaN values, either by eliminating the whole record (row) or eliminating the whole feature (column).

A common step in data preprocessing is to eliminate the record considering that the record is corrupt.
Eliminating a whole column could cost you a lot of valuable information compared to removing a row.

In [8]:
store_items.dropna(axis = 0) # removing 2 rows

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [9]:
store_items.dropna(axis = 1) # removing 3 columns (features)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

Notice that the .dropna() method eliminates (drops) the rows or columns with NaN values out of place.

This means that the original DataFrame is not modified.

**You can always remove the desired rows or columns in place by setting the keyword _"inplace = True"_ inside the dropna() function.**

### 2- Substituting NaN Values
The method we will be using is .fillna(). 

There are, for now, two ways to use this method:
1. **DataFrame.fillna(number):** This way will change all NaN values to a constant.
2. **DataFrame.fillna(method, axis):** This way will change all NaN values to a values choosen be a method you will specify.
3. **DataFrame.interpolate(method, axis):** This way will change all NaN values to an "Estimated" value according to a method of your choice excuted on a specific axis.

Notice that the .fillna() method replaces (fills) the NaN values **out of place**.\
This means that the original DataFrame is not modified.\
You can always replace the NaN values in place by setting the keyword **inplace = True** inside the fillna() function.

#### 1 - Fill With a Constant

In [10]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

#### 2.a- Forward Fill Method (Colmun)
This method will replace NaN values with **"previous values"** in the DataFrame, this is known as forward filling.

When replacing NaN values with forward filling, we can use previous values taken from columns or rows.

In [11]:
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

!["Forward Fill Method"](Images/ffill_row.png)

Notice that the two NaN values in store 3 have been replaced with previous values in their columns.

However, notice that the NaN value in store 1 didn't get replaced.\
That's because there are no previous values in this column, since the NaN value is the first value in that column.

#### 2.a- Forward Fill Method (Row)

In [12]:
# We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

!["Forward Fill Method"](Images/ffill_row.png)

#### 2.b- Back Fill Method (Column)
Similarly, you can choose to replace the NaN values with the **"values that go after them"** in the DataFrame, this is known as backward filling.

The .fillna(method = 'backfill', axis) will use the backward filling (backfill) method to replace NaN values using the next known value along the given axis.

In [13]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

!["Backward Fill Method"](Images/backfill_col.png)

Notice that the NaN value in store 1 has been replaced with the next value in its column.

However, notice that the two NaN values in store 3 didn't get replaced.\
That's because there are no next values in these columns, since these NaN values are the last values in those columns.

#### 2.b- Back Fill Method (Row)

In [14]:
# We replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

!["Backward Fill Method"](Images/backfill_row.png)

#### 3- Interpolate

In [15]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [16]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0